$("#info").on("click", function () {
    $("#student-main").html(
        "<p>&emsp;&emsp;随着信息技术的飞速发展，软件产品的规模也越来越庞大，各软件企业都在积极将软件项目管理引入到开发活动中，对软件项目实行有效的管理。软件项目管理是为了使软件项目能够按照预定的成本、进度、质量顺利完成，而进行分析和管理的活动。另外，进行软件项目管理有利于将个人开发能力转化成企业的开发能力，企业的软件开发能力越高，表明这个企业的软件生产越趋向于成熟，企业越能够稳定发展。特别是在当今的软件项目中，项目管理的质量与软件产品的质量有着直接的对应关系，因此，提高项目管理的能力对于软件组织生产力的提高是极为重要的。</p>" +
        "<p>&emsp;&emsp;《软件项目管理》是软件工程专业开设的专业课程，以培训更加专业的软件项目管理者为目的，统计表明：97%项目的成功是由有经验的项目经理领导的结果。而且随着我国软件产业规模的不断扩大，保证项目的成功，需要更多高素质的项目管理者。该课程涉及内容广泛、实践性强、新技术新方法多。本课程是向软件项目管理的人员传授项目管理的理论、方法以及技巧，让学生可以在短时间内掌握软件项目管理的基本知识和实践能力。讲授了作为一个软件项目经理的主要工作，职责和权利。本课程注重理论与实际的结合，通过实际工作中的案例说明帮助您对所学内容的消化和理解。本课程是一门理论基础与先进实践技术相结合的工程类课程，它涵盖了项目管理的基本概念、软件项目管理理论、软件项目管理方法、软件项目管理工具等多方面的内容。</p>" +
        "<p>&emsp;&emsp;本课程中，首先通过面授的方式，讲述项目管理基本概念、软件过程概念、软件项目管理经典理论、技术等基础内容以及软件项目工具；其次，选择比较典型的软件企业的项目管理案例，逐步向学生讲述案例的实施过程；最后，课程还安排课内实验和课外实践，课内实验要求学生采用项目管理工具编制项目管理计划；课外实践是根据一个具体项目，应用所学的知识实施项目管理，并采用工具跟踪控制项目。</p>" +
        "<p>&emsp;&emsp;教学过程中，面授采用教师和学员之间的多向交流的方式，对软件项目中的各种实际问题展开深入的讨论，充分激发学生的思考力，提高学生分析和解决问题的能力，以达到更好的教学效果；项目实践部分以分组的方式进行一个小项目,每组5人左右,每人分担不同的角色，其中选定一个项目经理,由项目经理对项目组中的成员分配角色，包括需求管理角色，设计角色，开发角色，质量管理角色等，然后设定不同的职责，让学生熟悉团队开发的基本模式，协同开发。由项目经理组织项目计划的编制和跟踪管理。</p>" +
        "<p>&emsp;&emsp;教学过程中除了面授的主讲教师，还有助理教师负责实践环节。教学需要多媒体教室一间，用于面授教学和案例演示；具备软件管理工具的机器，如：Microsoftproject和Rational Portfolio Manager。</p>"
    );
});
$("#content").on("click", function () {
    $("#student-main").html(
        "<p>项目负责人韩万江2003开始一直致力于软件工程和软件项目管理领域的研究和开发，探讨如何高效，实用的教学方式和方法，为此提出系列案例式教学模式，包括软件工程的三个方面：软件开发、软件项目管理和软件过程改进。为此与出版社有计划的出版系列案例教材：软件项目管理案例教程、软件工程案例教程和软件过程改进案例教程，其中前2个已经出版，并得到各高校很多教师的好评。不少的高校老师采用他们作为教材，尤其《软件项目管理教程》这个教材已经出版2年多，每天差不多都会收到老师的邮件，回答他们关于《软件项目管理案例教程》的问题。</p>" +
        "<p>《软件项目管理》是软件工程专业开设的专业课程，以培训更加专业的软件项目管理者为目的，统计表明：97%项目的成功是由有经验的项目经理领导的结果。而且随着我国软件产业规模的不断扩大，保证项目的成功，需要 更多高素质的项目管理者。该课程涉及内容广泛、实践性强、新技术新方法多。</p>" +
        "<p>主要成果如下：</p>" +
        "<ul><li>出版教材如下：<ul>" +
        "<li>2004年1月出版教材《软件开发项目管理》机械工业出版社</li>" +
        "<li>2005年1月出版教材《软件项目管理案例教程》机械工业出版社</li>" +
        "<li>2006年5月出版翻译教材《实用IT项目管理》机械工业出版社</li>" +
        "<li>2007年2月出版教材《软件工程案例教程》机械工业出版社</li></ul></li>" +
        "<li>在《计算机应用研究》的核心期刊上发表文章如下：<ul>" +
        "<li>2005年7月《过程管理在软件项目管理中的作用》</li>" +
        "<li>2007年7月《软件项目管理的实质》</li></ul></li>" +
        "<li>在《计算机世界》发表如下文章：<ul>" +
        "<li>2005年8月 《如何实施软件项目的过程管理》</li>" +
        "<li>2006年3月 《软件的工程化管理》</li>" +
        "<li>2006年4月 《软件项目管理的实质》</li>" +
        "<li>2007年1月 《IPv6将取代IPv4》</li>" +
        "<li>2007年4月 《软件工程的三线索》</li>" +
        "<li>2007年4月 《软件的开发过程》</li>" +
        "<li>2007年4月 《软件开发工艺的改进》</li>" +
        "<li>2007年4月 《软件生产线的管理》</li></ul></li></ul>"
    );
});
$("#practice").on("click", function () {
    $("#student-main").html(
        "<p>高校学生的实习是教育教学的重要环节,是加强专业知识教育,增加学生的感性认识,培养学生实践知识、实践能力、综合素质、创新能力的重要综合性训练环节。通过实践,一方面加深学生对书本知识的理解和学习,另一方面提高他们在理论知识的指导下分析问题解决问题的实际能力.将二者有机结合,以达到培养适应国家、社会、市场需求的应用型人才,已经显得尤为重要。</p>" +
        "<p>为此，我们与多家企业建立了合作关系，让学生有机会到企业中进行项目实践，提供和锻炼学生的实践能力。</p>" +
        "<p>主要的合作的企业包括：中大数据通信，时力科技，普天首信，亚信科技，摩托罗拉电子，NTT DATA，北京惠普，北京佳讯飞鸿，北京捷通软件，国讯科技，北京奥特四维，神州数码等等。</p>"
    );
});
$("#team").on("click", function () {
    $("#student-main").html(
        "<p>参与本课程建设的教师队伍很强大，项目负责人有10年的软件企业的项目管理经验，2002年到北京邮电大学负责软件项目管理课程的教学任务，5年来为工程硕士授课《软件项目管理》1000学时以上，为本科授课《软件项目管理》100学时，同时出版多本项目管理方面的教材，得到很多高校教师的肯定。</p>" +
        "<p>另外，参与课程建设的张笑燕、王安生、窦春燕等老师更是在本行业有突出建树的高级教授和讲师，他们都有美国、英国等访问学者的背景，在软件工程、软件管理、过程改进等方面发表很多论文。</p>" +
        "<p>课程开发项目组成员情况</p>" +
        "<ul><li>韩万江，硕士学位，副教授，在课程项目开发中担任项目负责人的角色。</li>" +
        "<li>张笑燕，硕士学位，副教授（软件学院副院长），在课程项目开发中负责教学大纲，教学计划，实践计划等工作。</li>" +
        "<li>王安生，硕士学位，教授（院长助理），在课程项目开发中负责实践环节课程的开发。</li>" +
        "<li>窦春燕，硕士学位，讲师，在课程项目开发中负责网站的建设。</li></ul>"
    );
});
$("#work").on("click", function () {
    $("#student-main").html(
        "<p>找不到放什么</p>"
    );
});
$("#contact").on("click", function () {
    $("#student-main").html(
        "<p>联系人：韩万江</p>" +
        "<p>信箱：hanwanjiang@bupt.edu.cn</p>" +
        "<p>电话：18911815877</p>"
    );
});